In [1]:
import os
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from datetime import date, timedelta
from pandas.tseries.offsets import * 
import calendar

pd.options.display.max_rows = 30

engine = create_engine("mysql+pymysql://root:@localhost:3306/stock")
const = engine.connect()

data_path = "../data/"
csv_path = "\\Users\\User\\iCloudDrive\\"
one_path = "\\Users\\User\\OneDrive\\Documents\\Data\\"
osd_path = "\\Users\\User\\OneDrive\\Documents\\obsidian-git-sync\\Data\\"

today = date.today()
yesterday = today - timedelta(days=1)
today, yesterday

(datetime.date(2023, 6, 23), datetime.date(2023, 6, 22))

In [2]:
#today = date(2023, 4, 25)
yesterday = today - timedelta(days=1)
today, yesterday

(datetime.date(2023, 6, 23), datetime.date(2023, 6, 22))

In [3]:
# convert the timedelta object to a BusinessDay object
num_business_days = BDay(2)
yesterday = today - num_business_days
print(f'today: {today}')
to_mmdd = today.strftime('%m-%d')
print(f'Today in mm-dd format: {to_mmdd}')
print(f'yesterday: {yesterday}')

today: 2023-06-23
Today in mm-dd format: 06-23
yesterday: 2023-06-21 00:00:00

In [4]:
#yesterday = yesterday.date()
yesterday

Timestamp('2023-06-21 00:00:00')

In [5]:
sql = '''
SELECT period, name, volbuy AS shares
FROM buy
ORDER BY period, name'''
buy = pd.read_sql(sql, const)
buy['shares'] = buy['shares'].astype('int64')
buy

   period     name  shares
0       1    JASIF  130000
1       1      MCS   78000
2       1    PTTGC    6000
3       1      TMT   36000
4       2      ASK    4500
5       2      ASP   30000
6       2    BANPU   30000
7       2  CPNREIT   60000
8       2      DIF   32000
9       2   GVREIT   30000
10      2      NER   27000
11      2      ORI   45000
12      2      RCL   27000
13      2     SENA  105000
14      2      STA    5000
15      2    WHAIR   50000
16      2    WHART   30000
17      3      IVL    7200
18      3      JMT    6000
19      3      SCC     600
20      4       AH    1200
21      4      AWC    9000
22      4      BCH   15000
23      4     ICHI    1500
24      4    JMART    9000
25      4      KCE   10000
26      4      KTC     900
27      4   SINGER    6000
28      4    SYNEX   15000

In [6]:
file_name = "buy-input.csv"
data_file = data_path + file_name
osd_file = osd_path + file_name
buy.to_csv(data_file, index=False)
buy.to_csv(osd_file, index=False)

In [7]:
sql = """
SELECT *
FROM price
LIMIT 1"""
prices = pd.read_sql(sql, const)
prices.dtypes

name      object
date      object
price    float64
maxp     float64
minp     float64
qty        int64
opnp     float64
dtype: object

### Call ruby ruby\find-change-fm-2-dates.rb

In [8]:
%pwd

'C:\\Users\\User\\OneDrive\\A7\\Daily'

In [9]:
os.chdir("C:\\users\\user\\onedrive\\a7")
%pwd

'C:\\users\\user\\onedrive\\a7'

In [10]:
!ruby ruby\\find-change-fm-2-dates.rb '2022-12-30' '2023-06-23'

    period       name     shares      date1      date2     price1     price2     change    %change     amount        spd
         1      JASIF     130000   22-12-30   23-06-23       8.05       7.10      -0.95     -11.80 -123,500.00        -19
         1        MCS      78000   22-12-30   23-06-23       8.95       6.75      -2.20     -24.58 -171,600.00        -44
         1      PTTGC       6000   22-12-30   23-06-23      47.25      37.25     -10.00     -21.16 -60,000.00        -40
         1        TMT      36000   22-12-30   23-06-23       7.80       7.35      -0.45      -5.77 -16,200.00         -9
         2        ASK       4500   22-12-30   23-06-23      35.50      25.00     -10.50     -29.58 -47,250.00        -42
         2        ASP      30000   22-12-30   23-06-23       2.98       2.82      -0.16      -5.37  -4,800.00         -8
         2      BANPU      30000   22-12-30   23-06-23      13.70       9.15      -4.55     -33.21 -136,500.00        -54
         2    CPNREIT      60000   22-12-30   23-06-23      19.50      11.00      -8.50     -43.59 -510,000.00        -85
         2        DIF      32000   22-12-30   23-06-23      13.20      10.60      -2.60     -19.70 -83,200.00        -26
         2     GVREIT      30000   22-12-30   23-06-23       9.10       8.45      -0.65      -7.14 -19,500.00        -13
         2        NER      27000   22-12-30   23-06-23       6.35       4.66      -1.69     -26.61 -45,630.00        -44
         2        ORI      45000   22-12-30   23-06-23      12.10      10.60      -1.50     -12.40 -67,500.00        -15
         2        RCL      27000   22-12-30   23-06-23      30.75      24.40      -6.35     -20.65 -171,450.00        -29
         2       SENA     105000   22-12-30   23-06-23       3.94       3.02      -0.92     -23.35 -96,600.00        -46
         2        STA       5000   22-12-30   23-06-23      21.10      17.10      -4.00     -18.96 -20,000.00        -40
         2      WHAIR      50000   22-12-30   23-06-23       7.45       7.20      -0.25      -3.36 -12,500.00         -5
         2      WHART      30000   22-12-30   23-06-23      10.70      10.60      -0.10      -0.93  -3,000.00         -1
         3        IVL       7200   22-12-30   23-06-23      40.75      34.25      -6.50     -15.95 -46,800.00        -26
         3        JMT       6000   22-12-30   23-06-23      69.00      36.75     -32.25     -46.74 -193,500.00       -129
         3        SCC        600   22-12-30   23-06-23     342.00     325.00     -17.00      -4.97 -10,200.00        -17
         4         AH       1200   22-12-30   23-06-23      29.75      32.25       2.50       8.40   3,000.00         10
         4        AWC       9000   22-12-30   23-06-23       6.30       4.88      -1.42     -22.54 -12,780.00        -32
         4        BCH      15000   22-12-30   23-06-23      20.50      17.60      -2.90     -14.15 -43,500.00        -29
         4       ICHI       1500   22-12-30   23-06-23      11.30      14.10       2.80      24.78   4,200.00         28
         4      JMART       9000   22-12-30   23-06-23      40.75      16.00     -24.75     -60.74 -222,750.00       -153
         4        KCE      10000   22-12-30   23-06-23      46.50      38.25      -8.25     -17.74 -82,500.00        -33
         4        KTC        900   22-12-30   23-06-23      59.00      50.50      -8.50     -14.41  -7,650.00        -34
         4     SINGER       6000   22-12-30   23-06-23      28.75       9.85     -18.90     -65.74 -113,400.00       -168
         4      SYNEX      15000   22-12-30   23-06-23      16.40      12.60      -3.80     -23.17 -57,000.00        -38

In [11]:
os.chdir("C:\\users\\user\\onedrive\\a7\\Daily")
%pwd

'C:\\users\\user\\onedrive\\a7\\Daily'

In [12]:
data_path = "../data/"
file_name   = 'prices-change.csv'
input_file = data_path + file_name
df = pd.read_csv(input_file, sep=',', index_col=None)
df.sample(5)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
22,4,BCH,15000,2022-12-30,2023-06-23,20.50,17.60,-2.90,-14.15,-43500.0,-29
13,2,SENA,105000,2022-12-30,2023-06-23,3.94,3.02,-0.92,-23.35,-96600.0,-46
17,3,IVL,7200,2022-12-30,2023-06-23,40.75,34.25,-6.50,-15.95,-46800.0,-26
10,2,NER,27000,2022-12-30,2023-06-23,6.35,4.66,-1.69,-26.61,-45630.0,-44
3,1,TMT,36000,2022-12-30,2023-06-23,7.80,7.35,-0.45,-5.77,-16200.0,-9

In [13]:
df.sample(5).sort_values(['spd'],ascending=False)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
8,2,DIF,32000,2022-12-30,2023-06-23,13.20,10.60,-2.60,-19.70,-83200.0,-26
22,4,BCH,15000,2022-12-30,2023-06-23,20.50,17.60,-2.90,-14.15,-43500.0,-29
10,2,NER,27000,2022-12-30,2023-06-23,6.35,4.66,-1.69,-26.61,-45630.0,-44
18,3,JMT,6000,2022-12-30,2023-06-23,69.00,36.75,-32.25,-46.74,-193500.0,-129
24,4,JMART,9000,2022-12-30,2023-06-23,40.75,16.00,-24.75,-60.74,-222750.0,-153

In [14]:
df.sample(5).sort_values(['spd'],ascending=True)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
6,2,BANPU,30000,2022-12-30,2023-06-23,13.70,9.15,-4.55,-33.21,-136500.0,-54
10,2,NER,27000,2022-12-30,2023-06-23,6.35,4.66,-1.69,-26.61,-45630.0,-44
12,2,RCL,27000,2022-12-30,2023-06-23,30.75,24.40,-6.35,-20.65,-171450.0,-29
11,2,ORI,45000,2022-12-30,2023-06-23,12.10,10.60,-1.50,-12.40,-67500.0,-15
20,4,AH,1200,2022-12-30,2023-06-23,29.75,32.25,2.50,8.40,3000.0,10

In [15]:
period = df.groupby("period")
period.sum()

        shares  price1  price2  change  %change     amount  spd
period
1       250000   72.05   58.45  -13.60   -63.31  -371300.0 -112
2       475500  186.37  144.60  -41.77  -244.85 -1217930.0 -408
3        13800  451.75  396.00  -55.75   -67.66  -250500.0 -172
4        67600  259.25  196.03  -63.22  -185.31  -532380.0 -449

In [16]:
df.groupby('period').agg(
      ttl_shr = pd.NamedAgg('shares', 'sum'),
      avr_p1  = pd.NamedAgg('price1','mean'),
      avr_p2  = pd.NamedAgg('price2','mean'),  
      avr_chg = pd.NamedAgg('change','mean'),
      avr_spd = pd.NamedAgg('spd','mean'),
      ttl_amt = pd.NamedAgg('amount', 'sum')
   )

        ttl_shr      avr_p1      avr_p2    avr_chg    avr_spd    ttl_amt
period
1        250000   18.012500   14.612500  -3.400000 -28.000000  -371300.0
2        475500   14.336154   11.123077  -3.213077 -31.384615 -1217930.0
3         13800  150.583333  132.000000 -18.583333 -57.333333  -250500.0
4         67600   28.805556   21.781111  -7.024444 -49.888889  -532380.0

In [17]:
pl = df.amount.sum()
pl

-2372110.0

In [18]:
prev_pl = -2_414_375
diff = pl - prev_pl
diff

42265.0